In [1]:
import pandas as pd
import numpy as np

In [6]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
'key2' : ['one', 'two', 'one', 'two', 'one'],
'data1' : np.random.randn(5),
'data2' : np.random.randn(5)})

In [7]:
df

  key1 key2     data1     data2
0    a  one  0.084429  0.725163
1    a  two  0.430322 -0.144211
2    b  one  1.055969  0.558359
3    b  two -0.805249  1.189001
4    a  one -1.076474  0.041089

In [10]:
grouped = df['data1'].groupby(df['key1'])

In [11]:
grouped.mean()

key1
a   -0.187241
b    0.125360
Name: data1, dtype: float64

In [13]:
grouped.describe()

,count,mean,std,min,25%,50%,75%,max
key1,,,,,,,,
a,3.0,-0.187241,0.789280,-1.076474,-0.496023,0.084429,0.257376,0.430322
b,2.0,0.125360,1.316079,-0.805249,-0.339944,0.125360,0.590664,1.055969

In [18]:
means=df['data1'].groupby([df['key1'],df['key2']]).mean()
means

key1  key2
a     one    -0.496023
      two     0.430322
b     one     1.055969
      two    -0.805249
Name: data1, dtype: float64

In [19]:
means.unstack()

key2       one       two
key1
a    -0.496023  0.430322
b     1.055969 -0.805249

In [20]:
states = np.array(['Ohio', 'California', 'California', 'Ohio', 'Ohio'])

In [21]:
years = np.array([2005, 2005, 2006, 2005, 2006])

In [23]:
df['data1'].groupby([states,years]).mean()

California  2005    0.430322
            2006    1.055969
Ohio        2005   -0.360410
            2006   -1.076474
Name: data1, dtype: float64

In [24]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.187241  0.207347
b     0.125360  0.873680

In [25]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.496023  0.383126
     two   0.430322 -0.144211
b    one   1.055969  0.558359
     two  -0.805249  1.189001

In [27]:
df.groupby(['key1','key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

In [29]:
for name , group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.084429  0.725163
1    a  two  0.430322 -0.144211
4    a  one -1.076474  0.041089
b
  key1 key2     data1     data2
2    b  one  1.055969  0.558359
3    b  two -0.805249  1.189001

In [30]:
for (k1,k2) , group in df.groupby(['key1','key2']):
    print(k1,k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one  0.084429  0.725163
4    a  one -1.076474  0.041089
a two
  key1 key2     data1     data2
1    a  two  0.430322 -0.144211
b one
  key1 key2     data1     data2
2    b  one  1.055969  0.558359
b two
  key1 key2     data1     data2
3    b  two -0.805249  1.189001

In [31]:
pieces = dict(list(df.groupby('key1')))

In [35]:
pieces['a']

  key1 key2     data1     data2
0    a  one  0.084429  0.725163
1    a  two  0.430322 -0.144211
4    a  one -1.076474  0.041089

In [36]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [37]:
grouped = df.groupby(df.dtypes, axis=1)

In [39]:
dict(list(grouped))

{dtype('float64'):       data1     data2
 0  0.084429  0.725163
 1  0.430322 -0.144211
 2  1.055969  0.558359
 3 -0.805249  1.189001
 4 -1.076474  0.041089, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

In [41]:
df.groupby('key1')['data1']

In [42]:
df.groupby('key1')[['data2']]

In [43]:
df['data1'].groupby(df['key1'])

In [45]:
people = pd.DataFrame(np.random.randn(5, 5),
columns=['a', 'b', 'c', 'd', 'e'],
index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])

In [47]:
people.ix[2:3, ['b', 'c']]=np.nan

/home/ayushi/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [48]:
people

               a         b         c         d         e
Joe    -1.127963  0.194929  0.754056  1.116899 -1.287851
Steve   0.068740 -1.614432  1.850919 -2.066107  0.226869
Wes     1.110130       NaN       NaN  0.076019 -0.133278
Jim     0.164989 -0.873182  0.420494  0.820211 -0.043670
Travis -0.857960  0.457906 -0.269833 -0.020486  0.173923

In [55]:
-1.127963

-0.8942340000000001

In [49]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [50]:
mapping

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [51]:
by_column = people.groupby(mapping, axis=1)

In [57]:
dict(list(by_column))

{'blue':                c         d
 Joe     0.754056  1.116899
 Steve   1.850919 -2.066107
 Wes          NaN  0.076019
 Jim     0.420494  0.820211
 Travis -0.269833 -0.020486, 'red':                a         b         e
 Joe    -1.127963  0.194929 -1.287851
 Steve   0.068740 -1.614432  0.226869
 Wes     1.110130       NaN -0.133278
 Jim     0.164989 -0.873182 -0.043670
 Travis -0.857960  0.457906  0.173923}

In [56]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.147156 -0.678252  1.174550  2.013129 -1.464799
5  0.068740 -1.614432  1.850919 -2.066107  0.226869
6 -0.857960  0.457906 -0.269833 -0.020486  0.173923

In [58]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [59]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -1.127963  0.194929  0.754056  0.076019 -1.287851
  two  0.164989 -0.873182  0.420494  0.820211 -0.043670
5 one  0.068740 -1.614432  1.850919 -2.066107  0.226869
6 two -0.857960  0.457906 -0.269833 -0.020486  0.173923

In [72]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
[1, 3, 5, 1, 3]], names=['cty', 'tenor'])

In [73]:
columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [74]:
pd.MultiIndex.from_arrays

In [76]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

In [77]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.058129 -0.099501 -0.826295 -1.420558 -0.349208
1      1.871471  1.814662 -0.697391 -0.957413  0.821572
2     -1.022048 -1.345212 -0.944445 -0.245104 -1.267652
3      1.500367 -0.215490  0.629366 -0.368359  0.401534

In [82]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [3]:
s = pd.Series(np.random.randn(6))